Revit 2027 API
Application.NewFamilySymbolProfile Method
Creates a new FamilySymbolProfile object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilySymbolProfile NewFamilySymbolProfile(
	FamilySymbol familySymbol
)
Public Function NewFamilySymbolProfile (
	familySymbol As FamilySymbol
) As FamilySymbolProfile
public:
FamilySymbolProfile^ NewFamilySymbolProfile(
	FamilySymbol^ familySymbol
)
member NewFamilySymbolProfile :
        familySymbol : FamilySymbol -> FamilySymbolProfile
Parameters
familySymbol FamilySymbol
The family symbol of the Profile.
Return Value
FamilySymbolProfile
The new FamilySymbolProfile object.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the argument familySymbol is null.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace